modm-io/modm/tests/stm32_p103/sd.cpp
	}

	/* Enable DMA RX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_RX, ENABLE);
	/* Enable DMA TX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_TX, ENABLE);

	/* Enable SPI TX/RX request */
	SPI_I2S_DMACmd(SPI_SD, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, ENABLE);

	/* Wait until DMA1_Channel 3 Transfer Complete */
	/// not needed: while (DMA_GetFlagStatus(DMA_FLAG_SPI_SD_TC_TX) == RESET) { ; }
	/* Wait until DMA1_Channel 2 Receive Complete */
	while (DMA_GetFlagStatus(DMA_FLAG_SPI_SD_TC_RX) == RESET) { ; }
	// same w/o function-call:
	// while ( ( ( DMA1->ISR ) & DMA_FLAG_SPI_SD_TC_RX ) == RESET ) { ; }

	/* Disable DMA RX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_RX, DISABLE);
	/* Disable DMA TX Channel */
	DMA_Cmd(DMA_Channel_SPI_SD_TX, DISABLE);

	/* Disable SPI RX/TX request */
	SPI_I2S_DMACmd(SPI_SD, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, DISABLE);
}
#endif /* STM32_SD_USE_DMA */


/*-----------------------------------------------------------------------*/
/* Power Control and interface-initialization (Platform dependent)       */
/*-----------------------------------------------------------------------*/

void
SdCard::power_on(void)
{
	XPCC_LOG_DEBUG << "power_on" << xpcc::endl;
	
	SPI_InitTypeDef  SPI_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	volatile uint8_t dummyread;

	/* Enable SPI clock, SPI1: APB2, SPI2: APB1 */
	RCC_APBPeriphClockCmd_SPI_SD(RCC_APBPeriph_SPI_SD, ENABLE);

	card_power(1);
	socket_cp_init();
	socket_wp_init();
	
	xpcc::delay_ms(250);
	
	/* Configure I/O for Flash Chip select */
	CS::setOutput(xpcc::stm32::OUTPUT, xpcc::stm32::PUSH_PULL, xpcc::stm32::SPEED_50MHZ);
	
	/* De-select the Card: Chip Select high */
	CS::set();

	/* Configure SPI pins: SCK and MOSI with default alternate function (not re-mapped) push-pull */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_SPI_SD_SCK | GPIO_Pin_SPI_SD_MOSI;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
	GPIO_Init(GPIO_SPI_SD, &GPIO_InitStructure);
	/* Configure MISO as Input with internal pull-up */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_SPI_SD_MISO;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
	GPIO_Init(GPIO_SPI_SD, &GPIO_InitStructure);

	/* SPI configuration */
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; // 72000kHz/256=281kHz < 400kHz
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial = 7;

	SPI_Init(SPI_SD, &SPI_InitStructure);
	SPI_CalculateCRC(SPI_SD, DISABLE);
	SPI_Cmd(SPI_SD, ENABLE);

	/* drain SPI */
	while (SPI_I2S_GetFlagStatus(SPI_SD, SPI_I2S_FLAG_TXE) == RESET) { ; }
	dummyread = SPI_I2S_ReceiveData(SPI_SD);

#ifdef STM32_SD_USE_DMA
	/* enable DMA clock */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
#endif
}

void
SdCard::power_off (void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	if (!(globalDiskStatus & STA_NOINIT)) {
		CS::reset();
		wait_ready();
		release_spi();
	}

	SPI_I2S_DeInit(SPI_SD);
	SPI_Cmd(SPI_SD, DISABLE);
	RCC_APBPeriphClockCmd_SPI_SD(RCC_APBPeriph_SPI_SD, DISABLE);

	/* All SPI-Pins to input with weak internal pull-downs */
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_SPI_SD_SCK | GPIO_Pin_SPI_SD_MISO | GPIO_Pin_SPI_SD_MOSI;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPD;
	GPIO_Init(GPIO_SPI_SD, &GPIO_InitStructure);
	
	card_power(0);
	
	globalDiskStatus |= STA_NOINIT;		/* Set STA_NOINIT */
}


/*-----------------------------------------------------------------------*/
/* Receive a data packet from MMC                                        */
/*-----------------------------------------------------------------------*/

bool
SdCard::rcvr_datablock (
	uint8_t *buff,			/* Data buffer to store received data */
	UINT btr			/* Byte count (must be multiple of 4) */
)
{
	uint8_t token;


	Timer1 = 10;
	do {							/* Wait for data packet in timeout of 100ms */
		token = stm32_spi_rw(0xff);
	} while ((token == 0xFF) && Timer1);
	if(token != 0xFE) return false;	/* If not valid data token, return with error */

#ifdef STM32_SD_USE_DMA
	stm32_dma_transfer( TRUE, buff, btr );
#else
	do {							/* Receive the data block into buffer */
		*(buff++) = stm32_spi_rw(0xff);
		*(buff++) = stm32_spi_rw(0xff);
		*(buff++) = stm32_spi_rw(0xff);
		*(buff++) = stm32_spi_rw(0xff);
	} while (btr -= 4);
#endif /* STM32_SD_USE_DMA */

	stm32_spi_rw(0xff);						/* Discard CRC */
	stm32_spi_rw(0xff);

	return true;					/* Return with success */
}



/*-----------------------------------------------------------------------*/
/* Send a data packet to MMC                                             */
/*-----------------------------------------------------------------------*/

bool
SdCard::xmit_datablock (
	const uint8_t *buff,	/* 512 byte data block to be transmitted */
	uint8_t token			/* Data/Stop token */
)
{
	uint8_t resp;
#ifndef STM32_SD_USE_DMA
	uint8_t wc;
#endif

	if (wait_ready() != 0xFF) return false;

	stm32_spi_rw(token);					/* transmit data token */
	if (token != 0xFD) {	/* Is data token */

#ifdef STM32_SD_USE_DMA
		stm32_dma_transfer( FALSE, buff, 512 );
#else
		wc = 0;
		do {							/* transmit the 512 byte data block to MMC */
			stm32_spi_rw(*buff++);
			stm32_spi_rw(*buff++);
		} while (--wc);
#endif /* STM32_SD_USE_DMA */

		stm32_spi_rw(0xFF);					/* CRC (Dummy) */
		stm32_spi_rw(0xFF);
		resp = stm32_spi_rw(0xff);				/* Receive data response */
		if ((resp & 0x1F) != 0x05)		/* If not accepted, return with error */
			return false;
	}

	return true;
}

/*-----------------------------------------------------------------------*/
/* Send a command packet to MMC                                          */
/*-----------------------------------------------------------------------*/

uint8_t
SdCard::send_cmd (
	uint8_t cmd,		/* Command byte */
	uint32_t arg		/* Argument */
)
{
	uint8_t n, res;
	
	if (cmd & 0x80) {	/* ACMD<n> is the command sequence of CMD55-CMD<n> */
		cmd &= 0x7F;
		res = send_cmd(CMD55, 0);
		if (res > 1) return res;
	}

	/* Select the card and wait for ready */
	CS::set();
	CS::reset();
	if (wait_ready() != 0xFF) {
		return 0xFF;
	}

	/* Send command packet */
	stm32_spi_rw(cmd);						/* Start + Command index */
	stm32_spi_rw((uint8_t)(arg >> 24));		/* Argument[31..24] */
	stm32_spi_rw((uint8_t)(arg >> 16));		/* Argument[23..16] */
	stm32_spi_rw((uint8_t)(arg >> 8));		/* Argument[15..8] */
	stm32_spi_rw((uint8_t)arg);				/* Argument[7..0] */
	n = 0x01;							/* Dummy CRC + Stop */
	if (cmd == CMD0) { n = 0x95; }		/* Valid CRC for CMD0(0) */
	if (cmd == CMD8) { n = 0x87; }		/* Valid CRC for CMD8(0x1AA) */
	stm32_spi_rw(n);
	
	/* Receive command response */
	if (cmd == CMD12) {
		stm32_spi_rw(0xff);		/* Skip a stuff byte when stop reading */
	}
	
	n = 10;								/* Wait for a valid response in timeout of 10 attempts */
	do {
		res = stm32_spi_rw(0xff);
	}
	while ((res & 0x80) && --n);
	
	return res;			/* Return with the response value */
}

// ----------------------------------------------------------------------------
xpcc::fat::Status
SdCard::initialize()
{
	XPCC_LOG_DEBUG << "disk_initialize" << xpcc::endl;
	
	uint8_t ocr[4];
	
	if (globalDiskStatus & STA_NODISK) {
		XPCC_LOG_DEBUG << "  no card" << xpcc::endl;
		return globalDiskStatus; /* No card in the socket */
	}
	
	power_on(); /* Force socket power on and initialize interface */
	interface_speed(INTERFACE_SLOW);
	for (uint_fast8_t n = 10; n; n--)
		stm32_spi_rw(0xff); /* 80 dummy clocks */
	
	uint8_t ty = 0;
	if (send_cmd(CMD0, 0) == 1)
	{
		/* Enter Idle state */
		
