modm-io/modm/tests/stm32_p103/sd.cpp
		Timer1 = 100; /* Initialization timeout of 1000 milliseconds */
		
		if (send_cmd(CMD8, 0x1AA) == 1)
		{
			XPCC_LOG_DEBUG << "  SDHC" << xpcc::endl;
			/* SDHC */
			for (uint_fast8_t n = 0; n < 4; n++)
				ocr[n] = stm32_spi_rw(0xff); /* Get trailing return value of R7 response */
			
			if (ocr[2] == 0x01 && ocr[3] == 0xAA)
			{
				/* The card can work at VDD range of 2.7-3.6V */
				while (Timer1 && send_cmd(ACMD41, 1UL << 30)) {
					/* Wait for leaving idle state (ACMD41 with HCS bit) */
				}
				if (Timer1 && send_cmd(CMD58, 0) == 0)
				{ /* Check CCS bit in the OCR */
					for (uint_fast8_t n = 0; n < 4; n++)
						ocr[n] = stm32_spi_rw(0xff);
					ty = (ocr[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
				}
			}
		}
		else
		{
			/* SDSC or MMC */
			uint8_t cmd;
			if (send_cmd(ACMD41, 0) <= 1)
			{
				ty = CT_SD1;
				cmd = ACMD41; /* SDSC */
				XPCC_LOG_DEBUG << "  SDSC" << xpcc::endl;
			}
			else
			{
				ty = CT_MMC;
				cmd = CMD1; /* MMC */
				XPCC_LOG_DEBUG << "  MMC" << xpcc::endl;
			}
			while (Timer1 && send_cmd(cmd, 0)) {
				// Wait for leaving idle state
			}
			if (!Timer1 || send_cmd(CMD16, 512) != 0) /* Set R/W block length to 512 */
				ty = 0;
		}
	}
	cardType = ty;
	release_spi();
	
	if (ty)
	{
		XPCC_LOG_DEBUG << "  success" << xpcc::endl;
		
		/* Initialization succeeded */
		globalDiskStatus &= ~STA_NOINIT; /* Clear STA_NOINIT */
		interface_speed(INTERFACE_FAST);
	}
	else
	{
		XPCC_LOG_DEBUG << "  failed" << xpcc::endl;
		
		/* Initialization failed */
		power_off();
	}
	
	return globalDiskStatus;
}

// ----------------------------------------------------------------------------
xpcc::fat::Status
SdCard::getStatus()
{
	XPCC_LOG_DEBUG << "disk_status " << xpcc::endl;
	XPCC_LOG_DEBUG << "  status=" << globalDiskStatus << xpcc::endl;
	return globalDiskStatus;
}

// ----------------------------------------------------------------------------
xpcc::fat::Result
SdCard::read(uint8_t *buffer, int32_t sectorNumber, uint8_t sectorCount)
{
	XPCC_LOG_DEBUG << "disk_read sector=" << sectorNumber << ", count=" << sectorCount << xpcc::endl;
	
	if (sectorCount == 0) {
		XPCC_LOG_DEBUG << "  failed - parameter error" << xpcc::endl;
		return RES_PARERR;
	}
	if (globalDiskStatus & STA_NOINIT) {
		XPCC_LOG_DEBUG << "  failed - not ready, status=" << globalDiskStatus << xpcc::endl;
		return RES_NOTRDY;
	}
	
	if (!(cardType & CT_BLOCK)) {
		// Convert to byte address if needed
		sectorNumber *= 512;
	}

	if (sectorCount == 1)
	{
		/* Single block read */
		if (send_cmd(CMD17, sectorNumber) == 0)	{ /* READ_SINGLE_BLOCK */
			if (rcvr_datablock(buffer, 512)) {
				sectorCount = 0;
			}
		}
	}
	else
	{
		// Multiple block read
		if (send_cmd(CMD18, sectorNumber) == 0)
		{
			// READ_MULTIPLE_BLOCK
			do {
				if (!rcvr_datablock(buffer, 512)) {
					break;
				}
				buffer += 512;
			} while (--sectorCount);
			send_cmd(CMD12, 0);				/* STOP_TRANSMISSION */
		}
	}
	release_spi();
	
	if (sectorCount == 0) {
		XPCC_LOG_DEBUG << "  success" << xpcc::endl;
	}
	else {
		XPCC_LOG_DEBUG << "  failed" << xpcc::endl;
	}
	
	return ((sectorCount != 0) ? RES_ERROR : RES_OK);
}

// ----------------------------------------------------------------------------
xpcc::fat::Result
SdCard::write(const uint8_t *buffer, int32_t sectorNumber, uint8_t sectorCount)
{
	XPCC_LOG_DEBUG << "disk_write" << xpcc::endl;
	
	if (sectorCount == 0)				return RES_PARERR;
	if (globalDiskStatus & STA_NOINIT)	return RES_NOTRDY;
	if (globalDiskStatus & STA_PROTECT)	return RES_WRPRT;
	
	if (!(cardType & CT_BLOCK)) {
		sectorNumber *= 512; /* Convert to byte address if needed */
	}
	
	if (sectorCount == 1)
	{
		// Single block write
		if ((send_cmd(CMD24, sectorNumber) == 0) && xmit_datablock(buffer, 0xFE)) {
			sectorCount = 0;
		}
	}
	else
	{
		// Multiple block write
		if (cardType & CT_SDC) {
			send_cmd(ACMD23, sectorCount);
		}
		
		if (send_cmd(CMD25, sectorNumber) == 0)
		{
			do
			{
				if (!xmit_datablock(buffer, 0xFC))
					break;
				buffer += 512;
			} while (--sectorCount);
			
			if (!xmit_datablock(0, 0xFD)) { /* STOP_TRAN token */
				sectorCount = 1;
			}
		}
	}
	release_spi();
	
	return (sectorCount > 0) ? RES_ERROR : RES_OK;
}

// ----------------------------------------------------------------------------
xpcc::fat::Result
SdCard::ioctl(uint8_t command, uint32_t *buffer)
{
	XPCC_LOG_DEBUG << "disk_ioctl" << xpcc::endl;
	
	DRESULT res;
	uint8_t n, csd[16];
	uint8_t *ptr = reinterpret_cast<uint8_t *>(buffer);
	uint16_t csize;
	
	res = RES_ERROR;
	
	if (command == CTRL_POWER)
	{
		switch (*ptr) {
		case 0:		/* Sub control code == 0 (POWER_OFF) */
			if (chk_power())
				power_off();		/* Power off */
			res = RES_OK;
			break;
		case 1:		/* Sub control code == 1 (POWER_ON) */
			power_on();				/* Power on */
			res = RES_OK;
			break;
		case 2:		/* Sub control code == 2 (POWER_GET) */
			*(ptr+1) = (uint8_t)chk_power();
			res = RES_OK;
			break;
		default :
			res = RES_PARERR;
		}
	}
	else {
		if (globalDiskStatus & STA_NOINIT) {
			return RES_NOTRDY;
		}
		
		switch (command) {
		case CTRL_SYNC :		/* Make sure that no pending write process */
			CS::reset();
			if (wait_ready() == 0xFF) {
				res = RES_OK;
			}
			break;

		case GET_SECTOR_COUNT :	/* Get number of sectors on the disk (uint32_t) */
			if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {
				if ((csd[0] >> 6) == 1) {	/* SDC version 2.00 */
					csize = csd[9] + ((uint16_t)csd[8] << 8) + 1;
					*(uint32_t*) buffer = (uint32_t) csize << 10;
				}
				else {					/* SDC version 1.XX or MMC*/
					n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
					csize = (csd[8] >> 6) + ((uint16_t)csd[7] << 2) + ((uint16_t)(csd[6] & 3) << 10) + 1;
					*(uint32_t*) buffer = (uint32_t) csize << (n - 9);
				}
				res = RES_OK;
			}
			break;

		case GET_SECTOR_SIZE :	/* Get R/W sector size (WORD) */
			*(uint16_t*)buffer = 512;
			res = RES_OK;
			break;

		case GET_BLOCK_SIZE :	/* Get erase block size in unit of sector (uint32_t) */
			if (cardType & CT_SD2) {	/* SDC version 2.00 */
				if (send_cmd(ACMD13, 0) == 0) {	/* Read SD status */
					stm32_spi_rw(0xff);
					if (rcvr_datablock(csd, 16)) {				/* Read partial block */
						for (n = 64 - 16; n; n--) {
							stm32_spi_rw(0xff);	/* Purge trailing data */
						}
						buffer[0] = 16UL << (csd[10] >> 4);
						res = RES_OK;
					}
				}
			} else {					/* SDC version 1.XX or MMC */
				if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {	/* Read CSD */
					if (cardType & CT_SD1) {	/* SDC version 1.XX */
						buffer[0] = (((csd[10] & 63) << 1) + ((uint16_t)(csd[11] & 128) >> 7) + 1) << ((csd[13] >> 6) - 1);
					}
					else {					/* MMC */
						buffer[0] = ((uint16_t)((csd[10] & 124) >> 2) + 1) * (((csd[11] & 3) << 3) + ((csd[11] & 224) >> 5) + 1);
					}
					res = RES_OK;
				}
			}
			break;

		case MMC_GET_TYPE :		/* Get card type flags (1 byte) */
			*ptr = cardType;
			res = RES_OK;
			break;

		case MMC_GET_CSD :		/* Receive CSD as a data block (16 bytes) */
			if (send_cmd(CMD9, 0) == 0 &&		/* READ_CSD */
				rcvr_datablock(ptr, 16)) {
				res = RES_OK;
			}
			break;

		case MMC_GET_CID :		/* Receive CID as a data block (16 bytes) */
			if (send_cmd(CMD10, 0) == 0	&&	/* READ_CID */
				rcvr_datablock(ptr, 16)) {
				res = RES_OK;
			}
			break;

		case MMC_GET_OCR :		/* Receive OCR as an R3 resp (4 bytes) */
			if (send_cmd(CMD58, 0) == 0) {	/* READ_OCR */
				for (n = 4; n; n--) {
					*ptr++ = stm32_spi_rw(0xff);
				}
				res = RES_OK;
			}
			break;

		case MMC_GET_SDSTAT :	/* Receive SD status as a data block (64 bytes) */
			if (send_cmd(ACMD13, 0) == 0) {	/* SD_STATUS */
				stm32_spi_rw(0xff);
				if (rcvr_datablock(ptr, 64)) {
					res = RES_OK;
				}
			}
			break;

		default:
			res = RES_PARERR;
		}

		release_spi();
	}

	return res;
}

// ----------------------------------------------------------------------------
// Device Timer Interrupt Procedure  (Platform dependent)                */
// ----------------------------------------------------------------------------
// This function must be called in period of 10ms                        */
void
SdCard::disk_timerproc (void)
{
	static uint32_t pv;
	uint32_t ns;
	uint8_t n, s;
	
	n = Timer1;                /* 100Hz decrement timers */
	if (n) {
		Timer1 = --n;
	}
	n = Timer2;
	if (n) {
		Timer2 = --n;
	}
	
	ns = pv;
	pv = socket_is_empty() | socket_is_write_protected();	/* Sample socket switch */

	if (ns == pv)		/* Have contacts stabled? */
	{
		s = globalDiskStatus;

		if (pv & socket_state_mask_wp) {
			// WP is H (write protected)
			s |= STA_PROTECT;
		}
		else {
			// WP is L (write enabled)
			s &= ~STA_PROTECT;
		}
		
		if (pv & socket_state_mask_cp) {
			// INS = H (Socket empty)
			s |= (STA_NODISK | STA_NOINIT);
		}
		else {
			// INS = L (Card inserted)
			s &= ~STA_NODISK;
		}
		
		globalDiskStatus = s;
	}
}
